Documents/НачислениеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>НачислениеПоЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейНачислено</Name>
							<Comment>Дней начислено</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтимулирующийТариф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПорога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорогПорядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГраницаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотребительУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейНачислено</Name>
							<Comment>Дней начислено</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотребительУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧленовСемьи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтимулирующийТариф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НазначенныеРегиональныеСубсидии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеРегиональныеСубсидии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегиональнойСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/НачислениеПоЛС/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаНачисленияУслуг.Организация КАК Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет КАК ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга КАК Услуга,
	|	СУММА(ВременнаяТаблицаНачисленияУслуг.Сумма) КАК Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.ДнейНачислено,
	|	СУММА(ВременнаяТаблицаНачисленияУслуг.Количество) КАК Количество,
	|	ВременнаяТаблицаНачисленияУслуг.Тариф,
	|	ВременнаяТаблицаНачисленияУслуг.Период,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ВидТарифа,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ДатаОкончанияПериода,
	|	ВременнаяТаблицаНачисленияУслуг.ДатаНачалаПериода,
	|	ВременнаяТаблицаНачисленияУслуг.СтимулирующийТариф,
	|	ВременнаяТаблицаНачисленияУслуг.Порог,
	|	ВременнаяТаблицаНачисленияУслуг.ЗначениеПорога
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.ДнейНачислено,
	|	ВременнаяТаблицаНачисленияУслуг.Тариф,
	|	ВременнаяТаблицаНачисленияУслуг.Период,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ВидТарифа,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ДатаОкончанияПериода,
	|	ВременнаяТаблицаНачисленияУслуг.ДатаНачалаПериода,
	|	ВременнаяТаблицаНачисленияУслуг.СтимулирующийТариф,
	|	ВременнаяТаблицаНачисленияУслуг.Порог,
	|	ВременнаяТаблицаНачисленияУслуг.ЗначениеПорога
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ЛицевойСчет,
	|	Услуга";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасшифровкаЛьгот(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаЛьгот.Период,
	|	ВременнаяТаблицаРасшифровкаЛьгот.Организация,
	|	ВременнаяТаблицаРасшифровкаЛьгот.ЛицевойСчет,
	|	ВременнаяТаблицаРасшифровкаЛьгот.Услуга,
	|	ВременнаяТаблицаРасшифровкаЛьгот.Льгота,
	|	ВременнаяТаблицаРасшифровкаЛьгот.ПотребительУслуг,
	|	ВременнаяТаблицаРасшифровкаЛьгот.Сумма,
	|	ВременнаяТаблицаРасшифровкаЛьгот.ДнейНачислено,
	|	ВременнаяТаблицаРасшифровкаЛьгот.Количество,
	|	ВременнаяТаблицаРасшифровкаЛьгот.Тариф,
	|	ВременнаяТаблицаРасшифровкаЛьгот.ДатаНачалаПериода,
	|	ВременнаяТаблицаРасшифровкаЛьгот.ДатаОкончанияПериода,
	|	ВременнаяТаблицаРасшифровкаЛьгот.ПроцентЛьготы,
	|	ВременнаяТаблицаРасшифровкаЛьгот.КоличествоЧленовСемьи,
	|	ВременнаяТаблицаРасшифровкаЛьгот.МесяцНачисления,
	|	ВременнаяТаблицаРасшифровкаЛьгот.СтимулирующийТариф
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаЛьгот КАК ВременнаяТаблицаРасшифровкаЛьгот";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасшифровкаНачисленияЛьгот", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасшифровкаЛьгот()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаНачисленияУслуг.Период КАК Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация КАК Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	СУММА(ВременнаяТаблицаНачисленияУслуг.Сумма) КАК Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.КонтрагентДляРасчетаПоЛьготам КАК Контрагент,
	|	ВременнаяТаблицаНачисленияУслуг.ДоговорДляРасчетаПоЛьготам КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ВидУслуги,
	|	ВременнаяТаблицаНачисленияУслуг.КонтрагентДляРасчетаПоЛьготам,
	|	ВременнаяТаблицаНачисленияУслуг.ДоговорДляРасчетаПоЛьготам";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоЛьготам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоЛьготам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаНачисленияУслуг.Период КАК Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация КАК Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	СУММА(ВременнаяТаблицаНачисленияУслуг.Сумма) КАК Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.КонтрагентДляРасчетаПоСубсидиям КАК Контрагент,
	|	ВременнаяТаблицаНачисленияУслуг.ДоговорДляРасчетаПоСубсидиям КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ВидУслуги,
	|	ВременнаяТаблицаНачисленияУслуг.КонтрагентДляРасчетаПоСубсидиям,
	|	ВременнаяТаблицаНачисленияУслуг.ДоговорДляРасчетаПоСубсидиям";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоРегиональнымСубсидиям(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаНачисленияУслуг.Период КАК Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация КАК Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	СУММА(ВременнаяТаблицаНачисленияУслуг.Сумма) КАК Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.КонтрагентРегиональнаяСубсидия КАК Контрагент,
	|	ВременнаяТаблицаНачисленияУслуг.ДоговорРегиональнаяСубсидия КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ВидУслуги,
	|	ВременнаяТаблицаНачисленияУслуг.КонтрагентРегиональнаяСубсидия,
	|	ВременнаяТаблицаНачисленияУслуг.ДоговорРегиональнаяСубсидия";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоРегиональнымСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаГаринтированныеСубсидии(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НАЧАЛОПЕРИОДА(&ДатаСреза, ЧАС) КАК Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация КАК Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления КАК ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.СуммаСубсидии КАК Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления КАК МесяцНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ГраницаСубсидии КАК ГраницаСубсидии
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.СуммаСубсидии,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ГраницаСубсидии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход),
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаНачисленияУслуг.Период, ЧАС),
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	-ВременнаяТаблицаНачисленияУслуг.Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ГраницаСубсидии
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаНачисленияУслуг.Период, ЧАС),
	|	-ВременнаяТаблицаНачисленияУслуг.Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.ГраницаСубсидии";
	
	Запрос.УстановитьПараметр("ДатаСреза", КонецМесяца(ДокументСсылкаНачислениеПоЛС.ПериодНачисления));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаНачислениеПоЛС.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРегиональныеСубсидии(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НАЧАЛОПЕРИОДА(&ДатаСреза, ЧАС) КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия) КАК ВидНачисления,
	|	НазначенныеРегиональныеСубсидииСрезПоследних.ЛицевойСчет,
	|	НазначенныеРегиональныеСубсидииСрезПоследних.Услуга,
	|	НАЧАЛОПЕРИОДА(&ДатаСреза, МЕСЯЦ) КАК МесяцНачисления,
	|	ВЫБОР
	|		КОГДА НазначенныеРегиональныеСубсидииСрезПоследних.Действует = ИСТИНА
	|			ТОГДА НазначенныеРегиональныеСубсидииСрезПоследних.СуммаРегиональнойСубсидии
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	РегистрСведений.НазначенныеРегиональныеСубсидии.СрезПоследних(
	|			НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ),
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет
	|				ИЗ
	|					ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг)) КАК НазначенныеРегиональныеСубсидииСрезПоследних
	|ГДЕ
	|	НазначенныеРегиональныеСубсидииСрезПоследних.Действует = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	НазначенныеРегиональныеСубсидииСрезПоследних.ЛицевойСчет,
	|	НазначенныеРегиональныеСубсидииСрезПоследних.Услуга,
	|	ВЫБОР
	|		КОГДА НазначенныеРегиональныеСубсидииСрезПоследних.Действует = ИСТИНА
	|			ТОГДА НазначенныеРегиональныеСубсидииСрезПоследних.СуммаРегиональнойСубсидии
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход),
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаНачисленияУслуг.Период, ЧАС),
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	-ВременнаяТаблицаНачисленияУслуг.Сумма
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга,
	|	ВременнаяТаблицаНачисленияУслуг.МесяцНачисления,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаНачисленияУслуг.Период, ЧАС),
	|	-ВременнаяТаблицаНачисленияУслуг.Сумма";
	
	Запрос.УстановитьПараметр("ДатаСреза", КонецМесяца(ДокументСсылкаНачислениеПоЛС.ПериодНачисления));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаНачислениеПоЛС.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРегиональныеСубсидии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасходованияСубсидии(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаНачисленияУслуг.Период КАК Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация КАК Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	СУММА(ВременнаяТаблицаНачисленияУслуг.Сумма) КАК Сумма,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга
	|ИЗ
	|	ВременнаяТаблицаНачисленияУслуг КАК ВременнаяТаблицаНачисленияУслуг
	|ГДЕ
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНачисленияУслуг.Период,
	|	ВременнаяТаблицаНачисленияУслуг.Организация,
	|	ВременнаяТаблицаНачисленияУслуг.ВидНачисления,
	|	ВременнаяТаблицаНачисленияУслуг.ЛицевойСчет,
	|	ВременнаяТаблицаНачисленияУслуг.Услуга";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходаСубсидий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()



Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеПоЛСУслуги.Услуга,
	|	СУММА(НачислениеПоЛСУслуги.СуммаНачислено) КАК Сумма,
	|	НачислениеПоЛСУслуги.ЛицевойСчет,
	|	НачислениеПоЛСУслуги.ДнейНачислено,
	|	СУММА(НачислениеПоЛСУслуги.Количество) КАК Количество,
	|	НачислениеПоЛСУслуги.Тариф,
	|	НачислениеПоЛСУслуги.Организация,
	|	КОНЕЦПЕРИОДА(НачислениеПоЛСУслуги.ПериодНачисления, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(НачислениеПоЛСУслуги.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
	|	НачислениеПоЛСУслуги.ВидТарифа,
	|	НачислениеПоЛСУслуги.ВидНачисления,
	|	НачислениеПоЛСУслуги.ДатаКонПериодаНазначения КАК ДатаОкончанияПериода,
	|	НачислениеПоЛСУслуги.ДатаНачПериодаНазначения КАК ДатаНачалаПериода,
	|	НачислениеПоЛСУслуги.Услуга.ВидУслуги КАК ВидУслуги,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентЛьгота КАК КонтрагентДляРасчетаПоЛьготам,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорЛьгота КАК ДоговорДляРасчетаПоЛьготам,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентСубсидия КАК КонтрагентДляРасчетаПоСубсидиям,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорСубсидия КАК ДоговорДляРасчетаПоСубсидиям,
	|	НачислениеПоЛСУслуги.СтимулирующийТариф,
	|	НачислениеПоЛСУслуги.Порог,
	|	НачислениеПоЛСУслуги.ЗначениеПорога,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентРегиональнаяСубсидия,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорРегиональнаяСубсидия,
	|	СУММА(НачислениеПоЛСУслуги.СуммаСубсидии) КАК СуммаСубсидии,
	|	НачислениеПоЛСУслуги.ГраницаСубсидии
	|ПОМЕСТИТЬ ВременнаяТаблицаНачисленияУслуг
	|ИЗ
	|	(ВЫБРАТЬ
	|		НачислениеПоЛСУслуги.Услуга КАК Услуга,
	|		НачислениеПоЛСУслуги.СуммаНачислено КАК СуммаНачислено,
	|		НачислениеПоЛСУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|		НачислениеПоЛСУслуги.ДнейНачислено КАК ДнейНачислено,
	|		НачислениеПоЛСУслуги.Количество КАК Количество,
	|		НачислениеПоЛСУслуги.Тариф КАК Тариф,
	|		ВЫБОР
	|			КОГДА НЕ НачислениеПоЛСУслуги.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|				ТОГДА НачислениеПоЛСУслуги.Услуга.Организация
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ НачислениеПоЛСУслуги.Ссылка.Здание.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|						ТОГДА НачислениеПоЛСУслуги.Ссылка.Здание.Организация
	|					ИНАЧЕ НачислениеПоЛСУслуги.Ссылка.Организация
	|				КОНЕЦ
	|		КОНЕЦ КАК Организация,
	|		НачислениеПоЛСУслуги.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|		НачислениеПоЛСУслуги.ВидТарифа КАК ВидТарифа,
	|		НачислениеПоЛСУслуги.ВидНачисления КАК ВидНачисления,
	|		НачислениеПоЛСУслуги.ДатаКонПериодаНазначения КАК ДатаКонПериодаНазначения,
	|		НачислениеПоЛСУслуги.ДатаНачПериодаНазначения КАК ДатаНачПериодаНазначения,
	|		НачислениеПоЛСУслуги.Услуга.ВидУслуги КАК ВидУслуги,
	|		НачислениеПоЛСУслуги.СтимулирующийТариф КАК СтимулирующийТариф,
	|		НачислениеПоЛСУслуги.Порог КАК Порог,
	|		НачислениеПоЛСУслуги.ЗначениеПорога КАК ЗначениеПорога,
	|		НачислениеПоЛСУслуги.СуммаСубсидии КАК СуммаСубсидии,
	|		НачислениеПоЛСУслуги.ГраницаСубсидии КАК ГраницаСубсидии
	|	ИЗ
	|		Документ.НачислениеПоЛС.Услуги КАК НачислениеПоЛСУслуги
	|	ГДЕ
	|		НачислениеПоЛСУслуги.Ссылка = &Ссылка) КАК НачислениеПоЛСУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ТабличнаяКонтрагентовДляСубсидийИЛьгот КАК ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот
	|		ПО НачислениеПоЛСУслуги.Организация = ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.Ссылка
	|			И НачислениеПоЛСУслуги.ВидУслуги = ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ВидУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеПоЛСУслуги.Услуга,
	|	НачислениеПоЛСУслуги.ВидТарифа,
	|	НачислениеПоЛСУслуги.Организация,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорРегиональнаяСубсидия,
	|	НачислениеПоЛСУслуги.ВидНачисления,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорЛьгота,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентРегиональнаяСубсидия,
	|	НачислениеПоЛСУслуги.ДатаКонПериодаНазначения,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентЛьгота,
	|	НачислениеПоЛСУслуги.ДатаНачПериодаНазначения,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорСубсидия,
	|	НАЧАЛОПЕРИОДА(НачислениеПоЛСУслуги.ПериодНачисления, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(НачислениеПоЛСУслуги.ПериодНачисления, МЕСЯЦ),
	|	НачислениеПоЛСУслуги.ЛицевойСчет,
	|	НачислениеПоЛСУслуги.СтимулирующийТариф,
	|	ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентСубсидия,
	|	НачислениеПоЛСУслуги.Порог,
	|	НачислениеПоЛСУслуги.ДнейНачислено,
	|	НачислениеПоЛСУслуги.ЗначениеПорога,
	|	НачислениеПоЛСУслуги.Тариф,
	|	НачислениеПоЛСУслуги.ГраницаСубсидии,
	|	НачислениеПоЛСУслуги.Услуга.ВидУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(НачислениеПоЛСЛьготы.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ НачислениеПоЛСЛьготы.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА НачислениеПоЛСЛьготы.Услуга.Организация
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ НачислениеПоЛСЛьготы.Ссылка.Здание.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|					ТОГДА НачислениеПоЛСЛьготы.Ссылка.Здание.Организация
	|				ИНАЧЕ НачислениеПоЛСЛьготы.Ссылка.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Организация,
	|	НачислениеПоЛСЛьготы.ЛицевойСчет,
	|	НачислениеПоЛСЛьготы.Услуга,
	|	НачислениеПоЛСЛьготы.Льгота,
	|	НачислениеПоЛСЛьготы.ПотребительУслуг,
	|	НачислениеПоЛСЛьготы.СуммаЛьготы КАК Сумма,
	|	НачислениеПоЛСЛьготы.ДнейНачислено,
	|	НачислениеПоЛСЛьготы.Количество,
	|	НачислениеПоЛСЛьготы.Тариф,
	|	НачислениеПоЛСЛьготы.ДатаНачПериодаНазначения КАК ДатаНачалаПериода,
	|	НачислениеПоЛСЛьготы.ДатаКонПериодаНазначения КАК ДатаОкончанияПериода,
	|	НачислениеПоЛСЛьготы.ПроцентЛьготы,
	|	НачислениеПоЛСЛьготы.КоличествоЧленовСемьи,
	|	НАЧАЛОПЕРИОДА(НачислениеПоЛСЛьготы.Ссылка.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
	|	НачислениеПоЛСЛьготы.СтимулирующийТариф
	|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаЛьгот
	|ИЗ
	|	Документ.НачислениеПоЛС.Льготы КАК НачислениеПоЛСЛьготы
	|ГДЕ
	|	НачислениеПоЛСЛьготы.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеПоЛС);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаГаринтированныеСубсидии(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	СформироватьТаблицуРасшифровкаЛьгот(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРегиональныеСубсидии(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоРегиональнымСубсидиям(ДокументСсылкаНачислениеПоЛС, СтруктураДополнительныеСвойства);
	
КонецПроцедуры


// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаНачислениеПоЛС, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	//Если разрешены отрицательные начисления тогда контроль остатков не выполняется
	Если Константы.РазрешитьОтрицательныеНачисления.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияРасчетыПоЛицевымСчетамИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет) КАК ЛицевойСчетПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга) КАК УслугаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления) КАК МесяцНачисленияПредставление,
		|	ЕСТЬNULL(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаИзменение, 0) + ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК ОстатокРасчетыПоЛицевымСчетам,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстатокРасчетыПоЛицевымСчетам
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|				&МоментКонтроля,
		|				(Организация, ЛицевойСчет, Услуга, МесяцНачисления) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления
		|					ИЗ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение)) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) < 0
		|	И РасчетыПоЛицевымСчетамОстатки.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Отрицательный остаток.
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектНачислениеПоЛС = ДокументСсылкаНачислениеПоЛС.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЛицевымСчетамСписком(ДокументОбъектНачислениеПоЛС, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет контроль повторного начисления.
//
Процедура ВыполнитьКонтрольПовторногоНачисления(ДокументСсылкаНачислениеПоЛС, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыПоЛицевымСчетамОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
		|				,
		|				,
		|				Регистратор,
		|				(Организация, ЛицевойСчет, Услуга, МесяцНачисления) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления
		|					ИЗ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение)) КАК РасчетыПоЛицевымСчетамОбороты
		|		ПО ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация = РасчетыПоЛицевымСчетамОбороты.Организация
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет = РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга = РасчетыПоЛицевымСчетамОбороты.Услуга
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления = РасчетыПоЛицевымСчетамОбороты.МесяцНачисления
		|ГДЕ
		|	РасчетыПоЛицевымСчетамОбороты.Регистратор <> &Ссылка
		|	И (РасчетыПоЛицевымСчетамОбороты.Регистратор ССЫЛКА Документ.РазовоеНачислениеУслуг
		|			ИЛИ РасчетыПоЛицевымСчетамОбороты.Регистратор ССЫЛКА Документ.НачислениеПоЛС
		|			ИЛИ РасчетыПоЛицевымСчетамОбороты.Регистратор ССЫЛКА Документ.НачислениеПениПоЛС)");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеПоЛС);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектНачислениеПоЛС = ДокументСсылкаНачислениеПоЛС.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокументОбъектНачислениеПоЛС, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
